[{"review_title": "Broken during shipping.", "review_text": "Some of the colors were broken and unusable.", "timestamp": 1627145842867, "rating": 3.0, "product_title": "MAEPEOR Eyeshadow Palette Glitter Matte Shimmer Eye Shadow Powder Long Lasting Waterproof Makeup"}, {"review_title": "Must be a new product.", "review_text": "Not the Pearl Drops I know and like.  Would not buy again.  Use?  Brush my teeth.", "timestamp": 1541887671189, "rating": 1.0, "product_title": "3X Pearl Drops Toothpolish Tooth Teeth Polish Freshmint"}, {"review_title": "I normally do not write bad reviews but this time I had to.", "review_text": "I normally do not write bad reviews but this time I had to. The lashes are beautiful. BUT each pair have lost at least one magnet from back of the lashes and the liner seems to never dry. Seriously it smudged hours after applied.", "timestamp": 1642755077952, "rating": 3.0, "product_title": "Magnetic Eyeliner and Magnetic Eyelashes,Waterproof Magnetic Eyeliner Set,Eyelashes With Natural Look,Easy to Wear,With Reusable Lashes (3 Styles)"}, {"review_title": "High value for money", "review_text": "High value for money for anybody who only use Head & Shoulders", "timestamp": 1428951817000, "rating": 5.0, "product_title": "Head and Shoulders Men Full and Thick 2-In-1 Dandruff Shampoo and Conditioner - 32.1 Fluid Ounces"}, {"review_title": "Lo mejor", "review_text": "Excelente! Saca todo el maquillaje y deja la piel suave", "timestamp": 1651528618477, "rating": 5.0, "product_title": "MIZON Cicaluronic Line, Cicaluronic Cleansing Balm, Makeup Remover, Centella Asiatica,Hyaluronic Acid, One Step Cleansing (2.7 fl oz)"}, {"review_title": "Just okay", "review_text": "Some of them would work but overall they are not etched enough for a stamper to pick up polish and are skinny so they slide around my plate book. But if you can get them to work the designs are adorable", "timestamp": 1572273664157, "rating": 3.0, "product_title": "AIFAIFA 12PCS Nail Stamping Plate for Nail Design, with Snowflake, Flowers, Lace, Butterfly, Line, Geometric, Rose Dandelion, Daisy Maple leaf, Bohemia Dream Catcher, Alphabet, Heart, Rabbit, Cute Cat"}, {"review_title": "Three Stars", "review_text": "Works well, smell not the greatest", "timestamp": 1515688564802, "rating": 3.0, "product_title": "Dial Men 3in1 Body, Hair and Face Wash, Ultimate Clean, 32 fl oz"}, {"review_title": "Nice wig", "review_text": "Nice wig and not bad for the cost.  Using it for a costume party.", "timestamp": 1578328882090, "rating": 4.0, "product_title": "HAIRSW Lady Women Blonde With Dark Root Medium Length Cascaded Layers Synthetic Hair Full Wig"}, {"review_title": "nice", "review_text": "Beautiful color and excellent cover", "timestamp": 1540307383177, "rating": 5.0, "product_title": "L'Oreal Silkissime Eyeliner 260 True Teal (2 Pack)"}, {"review_title": "Gift", "review_text": "Bought as gift", "timestamp": 1544910861873, "rating": 4.0, "product_title": "2 Pack Hanging Wig Stand, Portable Wig Drying Stand, Wig Head Stand for Women Long Wig or Short Wig, Collapsible Durable Wig Hanging Stand, Professional Wig Display Holder Tool (Black)"}, {"review_title": "Like but not love", "review_text": "I really liked the sponge set. However, I really wish I could have loved it. They are soft, but once you get the green one wet it feels weird on the skin. But, if you like sponges that aren’t really firm then these are a good pick for the price.", "timestamp": 1566570306517, "rating": 5.0, "product_title": "Makeup-Sponge Flawless Foundation Blending Sponge - Make Up Sponge for Liquid, Creams, and Powders, Multi Color Cosmetic Sponges"}, {"review_title": "Is a fine Hairbrush", "review_text": "This is fine paddle brush. I was in a pinch when I bought this and it worked well for me but I don't think it is of outstanding quality or value.", "timestamp": 1499413266030, "rating": 2.0, "product_title": "LOUISE MAELYS Large Detangling Paddle Hair Brush Hair Comb for Wet or Dry Hair"}, {"review_title": "If you like piña coladas...", "review_text": "This product was suggested to me from my review of [[ASIN:B00BFJGM5M Suavecito Pomade Original Hold 3-Pack]], where another customer talked about the hold.  This Shiner Gold does indeed have superior hold to most anything else I've used.  Your hair will stay in place all day long and then some.  But what really impressed me is that it also seems to tame and soften your hair at the same time.  I'm leaving this review 30 hours after applying the product and my hair still looks excellent.<br /><br />It does not have a greasy texture to it nor do you get that &#34;clumpy&#34; feeling as Suavecito can sometimes do.<br /><br />My only complaint - and it's a minor one - is the smell.<br /><br />Some people don't like Suavecito's smell.  I love it.  It smells like cologne.  As a man surely you can understand why that's a good thing.  I don't find Suavecito's smell to be overpowerful, and frankly you can't smell it 2 hours later anyway.<br /><br />Shiner Gold?  Smells like a piña colada, the smell lingers, and I can't stand it.  It is for this reason I can't apply it on my goatee; there I fall back to Suavecito.  A man should not walk around smelling like fruit, I'm sorry.", "timestamp": 1455390522000, "rating": 5.0, "product_title": "Shiner Gold Pomade | Strong Hold | High Shine | Water-based | Coconut Scent, 4oz"}, {"review_title": "Three Stars", "review_text": "The suction cups slid a bit more than I'd like.  The bristles were tickly.", "timestamp": 1439573251000, "rating": 3.0, "product_title": "Easy Feet Foot Cleaner"}, {"review_title": "Bang for your buck", "review_text": "This product comes with everything you need.", "timestamp": 1579809234176, "rating": 5.0, "product_title": "Lashfresh Eye & Lash Foaming Clean Wash Eyelash Extension Cleanser Organic/Natural + Style and Cleansing Brush 50ml"}, {"review_title": "Don’t waste your money", "review_text": "Roller tops do not roll. Waste of money.", "timestamp": 1550043931033, "rating": 1.0, "product_title": "Youngever 18 Pack Rainbow Color Essential Oil Roller Bottles with Stainless Steel Roller Balls in 9 Colors, Opener, 2 Clear Transfer Pipettes, 2 Mini Funnels and Extra Roller Ball"}, {"review_title": "it is definitely NOT liquid tape more like elmers glue in a little bottle", "review_text": "it is definitely NOT liquid tape more like elmers glue in a little bottle. So upset, but I guess you get what you pay for.", "timestamp": 1508870904754, "rating": 1.0, "product_title": "CITY 1 PC White Peel Off Liquid Tape Peel Off Base Coat Nail Art Liquid Palisade"}, {"review_title": "Don’t order", "review_text": "Smells horrible... not sure worth the money for the amount. Would not recommend and would not buy again.", "timestamp": 1584746533888, "rating": 1.0, "product_title": "Skinfix Ultra Rich Hand Cream 1 fl oz (1 fl oz)"}, {"review_title": "Would be great if I were a mermaid", "review_text": "I'm a very fair skinned redhead but this was too light even for me. It creates a shiny not dewy, oily not fresh look and it slightly tints my skin a faint blueish green. Would be great if I were a mermaid. And no returns? I'm bummed I didn't notice that or I wouldn't have bought it.", "timestamp": 1535667094284, "rating": 2.0, "product_title": "Lioele Blooming Shimmer Pearl Base 35Ml"}, {"review_title": "Disappointing", "review_text": "Start off well but Wear out quickly.", "timestamp": 1627076126258, "rating": 2.0, "product_title": "Glass Nail Files (6PCS) Crystal Glass Nail File Set by LURICO - Glass Manicure Tools - Glass Fingernail Files for Natural & Acrylic Nails Double Side Nail Care with Case- 6 Color"}, {"review_title": "Five Stars", "review_text": "great product", "timestamp": 1535914945239, "rating": 5.0, "product_title": "Naturevibe Botanicals Orange Peel Powder (8 Oz) | Citrus sinensis L."}, {"review_title": "Expect damage cannot return", "review_text": "Box came opened and smashed on the inside looks like a return", "timestamp": 1543454683394, "rating": 1.0, "product_title": "Dear Barber Beard Grooming Men's Set Collection, Beard Oil 30ml, Beard Balm 30ml And Beard Comb, Mens Gift set Christmas"}, {"review_title": "Misrepresentation.", "review_text": "What I didn't like is the Misrepresentation of products on Amazon, say it does amazing things when what it really does is nothing, no heat just a lotion.  Would Not recommend.", "timestamp": 1568513442547, "rating": 1.0, "product_title": "Hand Cream Moisturizing mildly warming with Peppermint scent 3 ounce"}, {"review_title": "Three Stars", "review_text": "Dries out my skin, haven't noticed a difference in my skin yet. I mix it with my moisturizer", "timestamp": 1450899331000, "rating": 3.0, "product_title": "Retinol 2.5 Serum for Face-Best Natural and Organic Skin Clearing For Wrinkles, Dark Spots and Crow's Feet"}, {"review_title": "I like it", "review_text": "It’s perfect for lace fronts. I’m a wild sleeper so if I was able to tie it twice around my head it would’ve been great. But I don’t regret my purchase !", "timestamp": 1619590253186, "rating": 4.0, "product_title": "LEORX 2pcs Edge Wrap Headband Satin Wig Grip Band Laying Scarf Wrap for Lace Frontal Wig (Purple)"}, {"review_title": "Great for gray hair!", "review_text": "I really like this conditioner for my silver gray hair. It makes it soft and beautiful. I get a lot of compliments.", "timestamp": 1579030250972, "rating": 5.0, "product_title": "Yes To Naturals Coconut & Argan Oil Ultra Moisture Conditioner for Dry & Damaged Hair, 12 Fluid Ounce"}, {"review_title": "Sun-like!", "review_text": "I love this color, it is so pretty on brown skin.  It’s more sparkly gold than yellow.  Very pretty.", "timestamp": 1556139019859, "rating": 5.0, "product_title": "OY-ANOTHER POLISH JOKE! NLE78 Nail Polish 0.5 fl OZ"}, {"review_title": "Vibrant colors but natural looking", "review_text": "I enjoyed looking for a lip pencil set that has the shades fit for me. And tha can be worn for any occasion night or day. One that can last a long time without reapplying every hour. And that was matte! Well with this lip set, your going to get what you're looking for!  It's everything I described above...BTW I like his set. My lip are vibrant and noticeable. The only thing I would change is the dryness of the pencil when applying is a bit harsh. So you may want to apply a small,very very very small bit of oil to your lips before application. Other than I can keep these lip pencils in my bag for helping moments.", "timestamp": 1621293690336, "rating": 5.0, "product_title": "Lip Liner Pencil Set - Matte Lipliner for Women Lip Makeup, Long Lasting Lip Liners Pencils (12 assorted colors) by “wonder X”"}, {"review_title": "need to send this back its SO shiny it also ...", "review_text": "need to send this back its SO shiny it also have very little light purple. Also I thought this was black w purple its all purple.The banding halo style or what ever was very hard to work with and its a heavy piece for that style attachment. Would need bobbies to hold in place", "timestamp": 1498425770364, "rating": 2.0, "product_title": "creamily Black Purple Mixed Powdery Violet 14\" Ombre Dip Dye Secret Miracle Wire Hair Extensions Synthetic Curly Wave Hairpieces 14\""}, {"review_title": "Three Stars", "review_text": "nice but wasn't as luxurious as i was expecting!", "timestamp": 1533878740124, "rating": 3.0, "product_title": "Refand Foundation Makeup Brush Flat Top Kabuki for Face - Perfect For Blending Liquid, Cream or Flawless Powder Cosmetics - Buffing, Stippling, Concealer (Round Brush)"}]
[{"timestamp": 1627145842867, "score": 3}, {"timestamp": 1541887671189, "score": 3}, {"timestamp": 1642755077952, "score": 5}, {"timestamp": 1428951817000, "score": 2}, {"timestamp": 1651528618477, "score": 3}, {"timestamp": 1572273664157, "score": 5}, {"timestamp": 1515688564802, "score": 2}, {"timestamp": 1578328882090, "score": 3}, {"timestamp": 1540307383177, "score": 2}, {"timestamp": 1544910861873, "score": 1}, {"timestamp": 1566570306517, "score": 5}, {"timestamp": 1499413266030, "score": 3}, {"timestamp": 1455390522000, "score": 5}, {"timestamp": 1439573251000, "score": 3}, {"timestamp": 1579809234176, "score": 2}, {"timestamp": 1550043931033, "score": 2}, {"timestamp": 1508870904754, "score": 3}, {"timestamp": 1584746533888, "score": 3}, {"timestamp": 1535667094284, "score": 5}, {"timestamp": 1627076126258, "score": 2}, {"timestamp": 1535914945239, "score": 1}, {"timestamp": 1543454683394, "score": 3}, {"timestamp": 1568513442547, "score": 3}, {"timestamp": 1450899331000, "score": 3}, {"timestamp": 1619590253186, "score": 3}, {"timestamp": 1579030250972, "score": 3}, {"timestamp": 1556139019859, "score": 3}, {"timestamp": 1621293690336, "score": 5}, {"timestamp": 1498425770364, "score": 5}, {"timestamp": 1533878740124, "score": 2}]
